## Staging: elasticache
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 3 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_elasticache_replication_group.notification-cluster-cache-multiaz-group will be updated in-place
  ~ resource "aws_elasticache_replication_group" "notification-cluster-cache-multiaz-group" {
        id                            = "notify-staging-cluster-cache-az"
      ~ security_group_ids            = [
          - "sg-04964fac41c144ae0",
          - "sg-0e2c3ef6c5c75b74c",
        ] -> (known after apply)
        tags                          = {
            "CostCenter" = "notification-canada-ca-staging"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_security_group.lambda_admin_pr_review[0] will be destroyed
  # (because aws_security_group.lambda_admin_pr_review is not in configuration)
  - resource "aws_security_group" "lambda_admin_pr_review" {
      - arn                    = "arn:aws:ec2:ca-central-1:239043911459:security-group/sg-04964fac41c144ae0" -> null
      - description            = "Lambda admin PR review environment and Redis communication" -> null
      - egress                 = [
          - {
              - cidr_blocks      = []
              - description      = "Allow outbound connections from the lambda admin PR review environment to the cluster"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 6379
            },
        ] -> null
      - id                     = "sg-04964fac41c144ae0" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow inbound connections to cluster from the lambda admin PR review environment"
              - from_port        = 6379
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 6379
            },
        ] -> null
      - name                   = "lambda-admin-pr-review" -> null
      - owner_id               = "239043911459" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - tags_all               = {
          - "CostCenter" = "notification-canada-ca-staging"
        } -> null
      - vpc_id                 = "vpc-097508d1f5e243195" -> null
    }

  # aws_security_group.redis_cluster[0] will be created
  + resource "aws_security_group" "redis_cluster" {
      + arn                    = (known after apply)
      + description            = "Access to the Redis cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "redis-cluster"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all               = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

  # aws_security_group_rule.cluster_ingress_from_lambda[0] will be destroyed
  # (because aws_security_group_rule.cluster_ingress_from_lambda is not in configuration)
  - resource "aws_security_group_rule" "cluster_ingress_from_lambda" {
      - cidr_blocks              = [] -> null
      - description              = "Allow inbound connections to cluster from the lambda admin PR review environment" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-1567649069" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-04964fac41c144ae0" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-04964fac41c144ae0" -> null
      - to_port                  = 6379 -> null
      - type                     = "ingress" -> null
    }

  # aws_security_group_rule.lambda_egress_to_cluster[0] will be destroyed
  # (because aws_security_group_rule.lambda_egress_to_cluster is not in configuration)
  - resource "aws_security_group_rule" "lambda_egress_to_cluster" {
      - cidr_blocks              = [] -> null
      - description              = "Allow outbound connections from the lambda admin PR review environment to the cluster" -> null
      - from_port                = 6379 -> null
      - id                       = "sgrule-2162657328" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-04964fac41c144ae0" -> null
      - self                     = true -> null
      - source_security_group_id = "sg-04964fac41c144ae0" -> null
      - to_port                  = 6379 -> null
      - type                     = "egress" -> null
    }

Plan: 1 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  + redis_cluster_security_group_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_replication_group.notification-cluster-cache-multiaz-group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.notification-canada-ca-cache-subnet"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.redis_cluster[0]"]

32 tests, 17 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
